app/controllers/api/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.temp_password = ('a'..'z').to_a.shuffle[0,8].join
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password", "password_confirmation", "temp_password", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    respond_to do |format|
      if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]